test/performance/scripts/food-ordering-system-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="food-ordering-system-load-test">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Order 1" enabled="true">
          <stringProp name="HTTPSampler.port">8181</stringProp>
          <stringProp name="HTTPSampler.path">v1/orders</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;customerId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb41&quot;,&#xd;
  &quot;restaurantId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb45&quot;,&#xd;
  &quot;address&quot;: {&#xd;
    &quot;street&quot;: &quot;street_1&quot;,&#xd;
    &quot;postalCode&quot;: &quot;1000AB&quot;,&#xd;
    &quot;city&quot;: &quot;Amsterdam&quot;&#xd;
  },&#xd;
  &quot;price&quot;: 1.00,&#xd;
  &quot;items&quot;: [&#xd;
    {&#xd;
      &quot;productId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb48&quot;,&#xd;
      &quot;quantity&quot;: 1,&#xd;
      &quot;price&quot;: 1.00,&#xd;
      &quot;subTotal&quot;: 1.00&#xd;
    }&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">orderTrackingId_1</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$..orderTrackingId</stringProp>
            <stringProp name="Sample.scope">all</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Order 2" enabled="true">
          <stringProp name="HTTPSampler.port">8182</stringProp>
          <stringProp name="HTTPSampler.path">v1/orders</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;customerId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb41&quot;,&#xd;
  &quot;restaurantId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb45&quot;,&#xd;
  &quot;address&quot;: {&#xd;
    &quot;street&quot;: &quot;street_1&quot;,&#xd;
    &quot;postalCode&quot;: &quot;1000AB&quot;,&#xd;
    &quot;city&quot;: &quot;Amsterdam&quot;&#xd;
  },&#xd;
  &quot;price&quot;: 1.00,&#xd;
  &quot;items&quot;: [&#xd;
    {&#xd;
      &quot;productId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb48&quot;,&#xd;
      &quot;quantity&quot;: 1,&#xd;
      &quot;price&quot;: 1.00,&#xd;
      &quot;subTotal&quot;: 1.00&#xd;
    }&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">orderTrackingId_2</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$..orderTrackingId</stringProp>
            <stringProp name="Sample.scope">all</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Order 3">
          <stringProp name="HTTPSampler.port">8183</stringProp>
          <stringProp name="HTTPSampler.path">v1/orders</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;customerId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb41&quot;,&#xd;
  &quot;restaurantId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb45&quot;,&#xd;
  &quot;address&quot;: {&#xd;
    &quot;street&quot;: &quot;street_1&quot;,&#xd;
    &quot;postalCode&quot;: &quot;1000AB&quot;,&#xd;
    &quot;city&quot;: &quot;Amsterdam&quot;&#xd;
  },&#xd;
  &quot;price&quot;: 1.00,&#xd;
  &quot;items&quot;: [&#xd;
    {&#xd;
      &quot;productId&quot;: &quot;d215b5f8-0249-4dc5-89a3-51fd148cfb48&quot;,&#xd;
      &quot;quantity&quot;: 1,&#xd;
      &quot;price&quot;: 1.00,&#xd;
      &quot;subTotal&quot;: 1.00&#xd;
    }&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">orderTrackingId_3</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$..orderTrackingId</stringProp>
            <stringProp name="Sample.scope">all</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="While Controller">
          <stringProp name="WhileController.condition">${__javaScript(&quot;${orderStatus_1}&quot; != &quot;APPROVED&quot; &amp;&amp; &quot;${orderStatus_1}&quot; != &quot;CANCELLED&quot;)}</stringProp>
        </WhileController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Order Result 1" enabled="true">
            <stringProp name="HTTPSampler.port">8181</stringProp>
            <stringProp name="HTTPSampler.path">v1/orders/${orderTrackingId_1}</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">orderStatus_1</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$..orderStatus</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="While Controller">
          <stringProp name="WhileController.condition">${__javaScript(&quot;${orderStatus_2}&quot; != &quot;APPROVED&quot; &amp;&amp; &quot;${orderStatus_2}&quot; != &quot;CANCELLED&quot;)}</stringProp>
        </WhileController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Order Result 2" enabled="true">
            <stringProp name="HTTPSampler.port">8182</stringProp>
            <stringProp name="HTTPSampler.path">v1/orders/${orderTrackingId_2}</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">orderStatus_2</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$..orderStatus</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="While Controller">
          <stringProp name="WhileController.condition">${__javaScript(&quot;${orderStatus_3}&quot; != &quot;APPROVED&quot; &amp;&amp; &quot;${orderStatus_3}&quot; != &quot;CANCELLED&quot;)}</stringProp>
        </WhileController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Order Result 3" enabled="true">
            <stringProp name="HTTPSampler.port">8183</stringProp>
            <stringProp name="HTTPSampler.path">v1/orders/${orderTrackingId_3}</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">orderStatus_3</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$..orderStatus</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>